Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase
The Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase class provides the base class for manipulating the custom parts.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.connection
The feature connection.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.manipulatorManager
The manipulator manager.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.description
The object type description.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.manipulationContextDictionary
The manipulation context dictionary.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.#ctor(System.Int32,System.String,System.Boolean)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase class.
id: The identifier of the custom part.
name: The name of the custom part.
useFeatureContextualToolBar:
The System.Boolean value to indicate whether the feature level contextual toolbar should be used.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.CustomParts
Gets the underlying custom parts for the feature.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.Initialize
Initializes the feature.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.Refresh
Refreshes the feature.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.AttachManipulationContexts(Tekla.Structures.Model.CustomPart)
Attaches the manipulation contexts to the custom part.
Remarks:
This method must be overridden to attach any custom manipulation ability to the custom part.
customPart: The custom part context.
Returns: A collection of manipulation contexts that should be attached to the custom part.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.GetActivationDefinitions


Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.OnActivated(Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs)


Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.OnRefreshSuggested(Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs)


Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.RefreshManipulationContexts(Tekla.Structures.Model.CustomPart,System.Collections.Generic.IEnumerable{Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext})
Clears and disposes the existing manipulation contexts and adds new manipulation contexts for the custom part.
customPart: The custom part.
contexts: The new manipluation contexts.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.AttachManipulator(Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase)
Attaches a manipulator to the feature.
manipulator: The manipulator to be attached.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.CustomPartManipulationFeatureBase.InitializeManipulationContexts(System.Collections.Generic.IEnumerable{Tekla.Structures.Model.CustomPart})
Initializes the manipulation contexts.
components: The custom parts.